[
  {
    "name": "Kevin McNerney",
    "avatar": "/images/team/kevin.png",
    "role": "CEO",
    "shortDescription": "Member of the American Numismatic Association | member of the Certified Coin Exchange | Market Maker & CCE platform Trader | member of NGC & PCGS",
    "description": "Kevin has been in the bullion and gold/silver rare coin industry since 1994.  He is well known in the industry and sits as a member of the American Numismatic Association which is a non-profit organization and collector mediation office dedicated to solving disputes and educating people on the study and collection of money-related items. Kevin is also a member of the Certified Coin Exchange, the largest dealer-to-dealer numismatic network.  Kevin is a key in-credited dealer and licensed “Market Maker”’ and trader on the CCE platform.  Kevin is also a member of the Major League Baseball Players Association and Numismatic Guaranty Corp. In his role with the NGC, Kevin became one of the top coin submitters and was successful in launching the coin commemorative program with Major League Baseball."
  },
  {
    "name": "Scott Comcowich",
    "avatar": "/images/team/scott.png",
    "role": "COO",
    "shortDescription": "Specializing in Connectors, Electromechanical Products, and Sensors\nMarketing Expert in Blockchain Technology and NFT marketplace",
    "description": "Scott has been involved in the tech industry since 1998, and his expertise is in electronic hardware product development and design.  He has a keen understanding of internal operations, lean manufacturing, and design for market release. A graduate from the University of Florida Warrington College of Business, he has held positions  with Fortune 500 companies. His most notable role was as a Managing Director of Scuf Gaming International.  During his tenure with Scuf, Scott was part of new product collaborations with the likes of Microsoft, Sony, Porsche, Hi-Rez studios, Optic Gaming, Faze Clan, and many other notable companies within the E-Sports sector.  Scott’s had a long-standing passion for gaming and blockchain, and his vision is to bring both value and utility to the NFT market space."
  },
  {
    "name": "Ryan J. Mueller",
    "avatar": "/images/team/ryan.png",
    "role": "CTO",
    "shortDescription": "Blockchain & Cryptocurrency Consultant | Web3 | DeFi | NFTs | DAOs | Tokenization | Ambassador for Propy | Luxury Real Estate Broker at RJM Real Estate Corp",
    "description": "He has been leveraging technology and building successful businesses since 2000. His career started in the real estate brokerage & development sector after graduating with honors from the University of Florida with a Bachelor of Science Degree in Business Administration.\nRyan is a serial entrepreneur, blockchain and cryptography expert, and real estate executive. He is one of the founders and the CTO at BlockCoin. Ryan is an Advisor and Ambassador for Propy, a Silicon Valley startup automating the real estate transaction process. Since 2014, Ryan has studied and immersed himself in blockchain technology, cryptography, and Bitcoin. As a result, he has a comprehensive, in-depth understanding of blockchain technology, cryptocurrencies, Web3, NFTs, DeFi, DOA, and the Tokenization of physical assets.\nRyan is passionate about the mass adoption of blockchain technology and its ability to democratize markets for the entire world to participate."
  }
]
